Revit 2024 API
PointCloudColorSettings Constructor (PointCloudColorMode)
 Constructs color settings object with default color for given color mode.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PointCloudColorSettings(
	PointCloudColorMode mode
)
Visual Basic
Public Sub New ( _
	mode As PointCloudColorMode _
)
Visual C++
public:
PointCloudColorSettings(
	PointCloudColorMode mode
)
Parameters
mode
Type: Autodesk.Revit.DB.PointCloudColorMode
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace